[{"model": "core.blog", "pk": 1, "fields": {"blog_category": "7", "title": "About Robotics", "created_on": "2023-09-17", "user": 1, "description": "Robotics is an interdisciplinary branch of electronics and communication, computer science and engineering.[1] Robotics involves the design, construction, operation, and use of robots. The goal of robotics is to design machines that can help and assist humans. Robotics integrates fields of mechanical engineering, electrical engineering, information engineering, mechatronics engineering, electronics, biomedical engineering, computer engineering, control systems engineering, software engineering, mathematics, etc.\r\n\r\nThe field of robotics develops machines that can automate tasks and do various jobs that a human might not be able to do. Robots can be used in many situations for many purposes, but today many are used in dangerous environments (including inspection of radioactive materials, bomb detection and deactivation), manufacturing processes, or where humans cannot survive (e.g., in space, underwater, in high heat, and clean up and containment of hazardous materials and radiation). Robots can take any form, but some are made to resemble humans in appearance. This is claimed to help in the acceptance of robots in certain replicative behaviors which are usually performed by people. Such robots attempt to replicate walking, lifting, speech, cognition, or any other tasks mainly performed by a human. Many of today's robots are inspired by nature, contributing to the field of bio-inspired robotics.\r\n\r\nCertain robots require user input to operate, while other robots function autonomously. The concept of creating robots that can operate autonomously dates back to classical times, but research into the functionality and potential uses of robots did not grow substantially until the 20th century. Throughout history, it has been frequently assumed by various scholars, inventors, engineers, and technicians that robots will one day be able to mimic human behavior and manage tasks in a human-like fashion. Today, robotics is a rapidly growing field, as technological advances continue; researching, designing, and building new robots serve various practical purposes, whether domestically, commercially, or militarily. Many robots are built to do jobs that are hazardous to people, such as defusing bombs, finding survivors in unstable ruins, and exploring mines and shipwrecks. Robotics is also used in STEM (science, technology, engineering, and mathematics) as a teaching aid.[2]", "image": "Media/robotics_sZxexnM.jpg", "view_count": 9}}, {"model": "core.blog", "pk": 2, "fields": {"blog_category": "9", "title": "How Technology is Changing the World of Medicine", "created_on": "2023-09-17", "user": 2, "description": "A large number of digital innovations are revolutionizing healthcare — and technology in medicine is here to stay. Numerous innovations and new solutions are already on the market and they have all improved healthcare drastically.\r\n\r\nMultiple medical issues such as congestive heart failure, diabetes, medication noncompliance, even stressful isolation, are researched and solved with remarkable new technologies. Here are some areas researchers are targeting:\r\n\r\nHeart failure\r\nOne of the most common and costly diagnoses is that of heart failure, with a mortality rate closer to cancer. It includes three types of sensors – wristband, necklace and watch – which are used for testing. This type of diagnosis gives both patients and doctors continuous information on how a compromised heart is functioning.", "image": "Media/AI_and_medicine_rP0C9z2.jpeg", "view_count": 3}}, {"model": "core.blog", "pk": 3, "fields": {"blog_category": "4", "title": "Golden Retriever", "created_on": "2023-09-17", "user": 2, "description": "The Golden Retriever was developed in Scotland in the nineteenth century by Sir Dudley Marjoribanks (later to become Baron Tweedmouth) from Flat-coated Retrievers judiciously crossed with Tweed Water Spaniels and some other British dog breeds.[1][2] Prior to the 1952 publication of the very detailed stud book which had been meticulously maintained by Marjoribanks, a number of romantic tales were published about the origins of the breed.[1][2][3]\r\n\r\nIn the 1860s Marjoribanks set out to create what to his mind was the ultimate breed of retriever at his Scottish estate Guisachan.[1][4] He started by acquiring a yellow-coloured Flat-coated Retriever dog called Nous;[note 1] Nous had been whelped in June 1864 and was the only yellow pup in an otherwise all black-coloured litter.[1][3] Whilst uncommon, occasionally liver, brown, golden or yellow-coloured purebred Flat-coated Retriever pups are whelped to matings of two black parents.[2][5] It is the pedigree of Nous that was the source for the romantic tales of the heritage of the Golden Retriever.[1] One early account claimed Nous was purchased from a Russian circus trainer in Brighton, another claimed he was bought from a cobbler, and yet another claimed a gypsy.[1] The stud book states that Nous was a Flat-coated Retriever bred by Lord Chichester on his Stanmer Park estate near Brighton.[4][5][6]", "image": "Media/goldenretriver2_gRm4wIv.jpeg", "view_count": 0}}, {"model": "core.blog", "pk": 4, "fields": {"blog_category": "1", "title": "Italy", "created_on": "2023-09-17", "user": 2, "description": "Italy (Italian: Italia [iˈtaːlja] i), officially the Italian Republic[a][13][14] or the Republic of Italy,[15][16] is a country in Southern[17][18][19] and Western[20][note 1] Europe. Located in the middle of the Mediterranean Sea, it consists of a peninsula delimited by the Alps and surrounded by several islands.[21] Italy shares land borders with France, Switzerland, Austria, Slovenia and the enclaved microstates of Vatican City and San Marino. It has a territorial exclave in Switzerland (Campione) and an archipelago in the African Plate (Pelagie Islands). Italy covers an area of 301,340 km2 (116,350 sq mi),[3] with a population of about 60 million;[22] it is the tenth-largest country by land area in the European continent and the third-most populous member state of the European Union. Its capital and largest city is Rome.\r\n\r\nThe Italian peninsula was historically the native place of numerous ancient peoples and destination of a myriad of different peoples and cultures who immigrated throughout history.[23] The ancient Roman state arose in Latium, and expanded throughout the peninsula and the territories around the Mediterranean basin through a process of Romanization.[24] By the first century BC, the Roman Empire expanded its territory across Europe, North Africa and the Near East, establishing the Pax Romana.[25] During the Early Middle Ages, the Western Roman Empire fell, Christian Church arose and Italy experienced inward migration from surrounding tribes. By the 11th century, Italian city-states and maritime republics expanded, bringing renewed prosperity through commerce and laying the groundwork for modern capitalism.[26][27] The Italian Renaissance flourished in Florence during the 15th and 16th centuries and spread to the rest of Europe. Italian explorers also discovered new routes to the Far East and the New World, helping to usher in the European Age of Discovery. However, centuries of rivalry and infighting between the Italian city-states among other factors left the peninsula divided into numerous states until the late modern period.[28][29] Italy's commercial and political power significantly waned during the 17th and 18th centuries with the decline of the Catholic Church and the increasing importance of trade routes that bypassed the Mediterranean.[30]", "image": "Media/rome-colosseum.jpg", "view_count": 3}}, {"model": "core.blog", "pk": 5, "fields": {"blog_category": "7", "title": "Backend Technologies", "created_on": "2023-09-17", "user": 3, "description": "Typically, backend technologies refer to the libraries of server-side languages that are used to create the server configuration of a website. The backend technologies form the basis of software development. Without specialized backend developers, fancy designs and intuitive interfaces created using front-end coding languages are not sufficient.\r\n\r\nIt is the backend of the website or application that allows it to function well, and be fast and responsive. But, due to the exponential growth of back-end technologies over the past few years, it can be difficult for developers to keep up with the sheer amount of technology at their disposal.  It is essential, however, regardless of whether you are an IT manager, startup founder, or a corporate decision-maker, that you pick the right backend technology before moving forward with your project.\r\n\r\nBenefits of Back-End Technologies\r\n\r\nAutomate tasks to streamline your workflow\r\nEnhance developers’ productivity\r\nSimplify development processes\r\nComes in handy when you’re on a tight deadline\r\nSpeed up development\r\nImprove product quality\r\nScalability and robustness\r\nEnhance security and ease of integration", "image": "Media/Backend.png", "view_count": 1}}, {"model": "core.blog", "pk": 6, "fields": {"blog_category": "7", "title": "If radiation is beneficial, why should we protect ourselves from it?", "created_on": "2023-09-18", "user": 4, "description": "Radiation has many beneficial applications but, as in every activity, when there are risks associated with its use specific actions need to be put in place to protect the people and the environment. Different types of radiation require different protective measures: a low energy form, called “non-ionizing radiation”, may require fewer protective measures than the higher energy “ionizing radiation”. The IAEA establishes standards for protection of the people and the environment in relation to the peaceful use of ionizing radiation – in line with its mandate.", "image": "Media/Radioactive.png", "view_count": 2}}, {"model": "core.blog", "pk": 14, "fields": {"blog_category": "7", "title": "Moon", "created_on": "2023-09-18", "user": 2, "description": "The Moon is Earth's only natural satellite. It orbits around Earth at an average distance of 384,400 km (238,900 mi), or about 30 times Earth's diameter, having a sidereal period of 27.3 days and a synodic period of 29.5 days. The Moon faces Earth always with its near side by having a rotation period that equals its orbital period, resulting from being tidally locked to Earth. Its gravitational influence is the main driver of Earth's tides and causes Earth's day to lengthen very slowly. Its diameter is 3,474 km (2,159 mi), which is roughly one-quarter that of Earth or twice the width of Australia,[17] making it by far the largest and most massive satellite in the Solar System in relation to its parent planet and the fifth-largest Solar System satellite overall. The Moon is a satellite planet in geophysical terms and among all planetary-mass objects of the Solar System larger and more massive than all known solar dwarf planets.[18] The Moon's mass, density and surface gravity of about one-sixth of Earth's (at 0.1654 g), are rivaled among Solar System satellites only by Jupiter's moon Io. The body of the Moon is differentiated and terrestrial, with no significant atmosphere, hydrosphere, or magnetic field.", "image": "Media/moon.webp", "view_count": 1}}, {"model": "core.blog", "pk": 15, "fields": {"blog_category": "11", "title": "Vincent van Gogh", "created_on": "2023-09-18", "user": 1, "description": "Vincent Willem van Gogh (Dutch: [ˈvɪnsɛnt ˈʋɪləɱ vɑŋ ˈɣɔx] i;[note 1] 30 March 1853 – 29 July 1890) was a Dutch Post-Impressionist painter who is among the most famous and influential figures in the history of Western art. In just over a decade he created approximately 2100 artworks, including around 860 oil paintings, most of them in the last two years of his life. They include landscapes, still lifes, portraits and self-portraits, and are characterised by bold, symbolic colours, and dramatic, impulsive and highly expressive brushwork that contributed to the foundations of modern art. Only one of his paintings was known by name to have been sold during his lifetime. Van Gogh became famous after his suicide, aged 37, which followed years of poverty and mental illness.", "image": "Media/Vangoh2.webp", "view_count": 1}}, {"model": "core.blog", "pk": 16, "fields": {"blog_category": "1", "title": "Paris", "created_on": "2023-09-19", "user": 2, "description": "Paris, France's capital, is a major European city and a global center for art, fashion, gastronomy and culture. Its 19th-century cityscape is crisscrossed by wide boulevards and the River Seine. Beyond such landmarks as the Eiffel Tower and the 12th-century, Gothic Notre-Dame cathedral, the city is known for its cafe culture and designer boutiques along the Rue du Faubourg Saint-Honoré.", "image": "Media/paris.jpg", "view_count": 0}}, {"model": "core.blog", "pk": 17, "fields": {"blog_category": "2", "title": "Fitness", "created_on": "2023-09-19", "user": 2, "description": "Physical fitness is a state of health and well-being and, more specifically, the ability to perform aspects of sports, occupations and daily activities. Physical fitness is generally achieved through proper nutrition,[1] moderate-vigorous physical exercise,[2] and sufficient rest along with a formal recovery plan.[3]\r\n\r\nBefore the Industrial Revolution, fitness was defined as the capacity to carry out the day's activities without undue fatigue or lethargy. However, with automation and changes in lifestyles, physical fitness is now considered a measure of the body's ability to function efficiently and effectively in work and leisure activities, to be healthy, to resist hypokinetic diseases, improve immune system and to meet emergency situations.[4]", "image": "Media/Fitness-Goals3_BNVNW6A.jpg", "view_count": 0}}, {"model": "core.blogimage", "pk": 4, "fields": {"blog": 14, "image": "Media/space2.jpeg"}}, {"model": "core.blogimage", "pk": 5, "fields": {"blog": 14, "image": "Media/moon2.webp"}}, {"model": "core.blogimage", "pk": 6, "fields": {"blog": 15, "image": "Media/vangoh.jpeg"}}, {"model": "core.blogimage", "pk": 7, "fields": {"blog": 15, "image": "Media/Vangoh2_SAoCyO0.webp"}}, {"model": "core.blogimage", "pk": 8, "fields": {"blog": 16, "image": "Media/robotics_hPkomHw.jpg"}}, {"model": "core.blogimage", "pk": 9, "fields": {"blog": 17, "image": "Media/fitness-4_K1sYj57.jpeg"}}, {"model": "core.blogimage", "pk": 10, "fields": {"blog": 17, "image": "Media/fitness2_B1MpALv.jpeg"}}, {"model": "core.teammember", "pk": 1, "fields": {"full_name": "Naira Mangasaryan", "job_position": "Back-end Developer", "about_member": "Back-end Developer", "member_image": "Media/nara_GO6Cd2W.png"}}, {"model": "core.teammember", "pk": 2, "fields": {"full_name": "Lilit Khachatryan", "job_position": "Back-end Developer", "about_member": "Back-end Developer", "member_image": "Media/lilit.png"}}, {"model": "core.teammember", "pk": 3, "fields": {"full_name": "Almast Hasoyan", "job_position": "Back-end Developer", "about_member": "Back-end Developer", "member_image": "Media/almast1.png"}}, {"model": "core.teammember", "pk": 4, "fields": {"full_name": "Alvard  Telunts", "job_position": "Back-end Developer", "about_member": "Back-end Developer", "member_image": "Media/Alvard.png"}}, {"model": "core.teammember", "pk": 5, "fields": {"full_name": "Mari Arakelyan", "job_position": "Back-end Developer", "about_member": "Back-end Developer", "member_image": "Media/mari.png"}}, {"model": "core.aboutteam", "pk": 1, "fields": {"our_team": "We are a very special team. Each of us has our preferences and very different professions. However, we were all brought together by our new hobby and our new profession. We all started studying Python as part of AGBU's Women Programmers program and it brought us together around this idea. \r\n\r\nWe created WoBlog with great love to make your daily life more interesting. We are sure that it will interest everyone. You can find anything here that will really interest you. Moreover, you can create your own bog by registering and becoming an indispensable member of our team. Below you can get acquainted with each of the team members.", "team_image": "Media/Our_Team_giSg4Cd.png"}}, {"model": "core.blogcomment", "pk": 1, "fields": {"owner": 1, "blog": 1, "text": "Very interesting.", "created_on": "2023-09-17T21:04:12.616Z"}}, {"model": "core.subscription", "pk": 1, "fields": {"email": "naraman@bk.ru", "subscribed_at": "2023-09-17T19:22:09.276Z"}}]